app/controllers/facilities_controller.rb

SELECT * FROM `facilities`
---
  def index
    @facilities = Facility.all

SELECT * FROM `facilities` WHERE (`facilities`.`zipcode` = '36092') LIMIT 1
---
  def view
  	  @facilities = Facility.find(:all,:conditions => ["zipcode like ?", params[:zipcode]])

SELECT * FROM `facilities` WHERE (`facilities`.`id` = 1)
---
  def show
    @facility = Facility.find(params[:id])